wajmh/Code/Firmware/GD32F50x_Firmware_Library/Firmware/GD32F50x_standard_peripheral/Include/gd32f50x_timer.h
/*!
    \file    gd32f50x_timer.h
    \brief   definitions for the TIMER
    
    \version 2025-11-10, V1.01, firmware for GD32F50x
*/

/*
    Copyright (c) 2025, GigaDevice Semiconductor Inc.

    Redistribution and use in source and binary forms, with or without modification, 
are permitted provided that the following conditions are met:

    1. Redistributions of source code must retain the above copyright notice, this 
       list of conditions and the following disclaimer.
    2. Redistributions in binary form must reproduce the above copyright notice, 
       this list of conditions and the following disclaimer in the documentation 
       and/or other materials provided with the distribution.
    3. Neither the name of the copyright holder nor the names of its contributors 
       may be used to endorse or promote products derived from this software without 
       specific prior written permission.

    THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS" 
AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED 
WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED. 
IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT, 
INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT 
NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR 
PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, 
WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) 
ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY 
OF SUCH DAMAGE.
*/

#ifndef GD32F50X_TIMER_H
#define GD32F50X_TIMER_H

#include "gd32f50x.h"

/* TIMERx(x=0..7,15,16) definitions */
#define TIMER0                           (TIMER_BASE + 0x00012C00U)              /*!< TIMER0 base address */
#define TIMER1                           (TIMER_BASE + 0x00000000U)              /*!< TIMER1 base address */
#define TIMER2                           (TIMER_BASE + 0x00000400U)              /*!< TIMER2 base address */
#define TIMER3                           (TIMER_BASE + 0x00000800U)              /*!< TIMER3 base address */
#define TIMER4                           (TIMER_BASE + 0x00000C00U)              /*!< TIMER4 base address */
#define TIMER5                           (TIMER_BASE + 0x00001000U)              /*!< TIMER5 base address */
#define TIMER6                           (TIMER_BASE + 0x00001400U)              /*!< TIMER6 base address */
#define TIMER7                           (TIMER_BASE + 0x00013400U)              /*!< TIMER7 base address */
#define TIMER15                          (TIMER_BASE + 0x00015000U)              /*!< TIMER15 base address */
#define TIMER16                          (TIMER_BASE + 0x00001800U)              /*!< TIMER16 base address */
        
/* registers definitions */     
#define TIMER_CTL0(timerx)               REG32((timerx) + 0x00U)                /*!< TIMER control register 0 */
#define TIMER_CTL1(timerx)               REG32((timerx) + 0x04U)                /*!< TIMER control register 1 */
#define TIMER_SMCFG(timerx)              REG32((timerx) + 0x08U)                /*!< TIMER slave mode configuration register */
#define TIMER_DMAINTEN(timerx)           REG32((timerx) + 0x0CU)                /*!< TIMER DMA and interrupt enable register */
#define TIMER_INTF(timerx)               REG32((timerx) + 0x10U)                /*!< TIMER interrupt flag register */
#define TIMER_SWEVG(timerx)              REG32((timerx) + 0x14U)                /*!< TIMER software event generation register */
#define TIMER_CHCTL0(timerx)             REG32((timerx) + 0x18U)                /*!< TIMER channel control register 0 */
#define TIMER_CHCTL1(timerx)             REG32((timerx) + 0x1CU)                /*!< TIMER channel control register 1 */
#define TIMER_CHCTL2(timerx)             REG32((timerx) + 0x20U)                /*!< TIMER channel control register 2 */
#define TIMER_CNT(timerx)                REG32((timerx) + 0x24U)                /*!< TIMER counter register */
#define TIMER_PSC(timerx)                REG32((timerx) + 0x28U)                /*!< TIMER prescaler register */
#define TIMER_CAR(timerx)                REG32((timerx) + 0x2CU)                /*!< TIMER counter auto reload register */
#define TIMER_CREP0(timerx)              REG32((timerx) + 0x30U)                /*!< TIMER counter repetition register 0 */
#define TIMER_CH0CV(timerx)              REG32((timerx) + 0x34U)                /*!< TIMER channel 0 capture/compare value register */
#define TIMER_CH1CV(timerx)              REG32((timerx) + 0x38U)                /*!< TIMER channel 1 capture/compare value register */
#define TIMER_CH2CV(timerx)              REG32((timerx) + 0x3CU)                /*!< TIMER channel 2 capture/compare value register */
#define TIMER_CH3CV(timerx)              REG32((timerx) + 0x40U)                /*!< TIMER channel 3 capture/compare value register */
#define TIMER_CCHP0(timerx)              REG32((timerx) + 0x44U)                /*!< TIMER complementary channel protection register */
#define TIMER_MCHCTL0(timerx)            REG32((timerx) + 0x48U)                /*!< Multi mode channel control register 0  */
#define TIMER_MCHCTL2(timerx)            REG32((timerx) + 0x50U)                /*!< Multi mode channel control register 2  */
#define TIMER_MCH0CV(timerx)             REG32((timerx) + 0x54U)                /*!< Multi mode channel 0 capture/compare value register  */
#define TIMER_CH0COMV_ADD(timerx)        REG32((timerx) + 0x64U)                /*!< TIMER channel 0 additional compare value register */
#define TIMER_CH1COMV_ADD(timerx)        REG32((timerx) + 0x68U)                /*!< TIMER channel 1 additional compare value register */
#define TIMER_CH2COMV_ADD(timerx)        REG32((timerx) + 0x6CU)                /*!< TIMER channel 2 additional compare value register */
#define TIMER_CH3COMV_ADD(timerx)        REG32((timerx) + 0x70U)                /*!< TIMER channel 3 additional compare value register */
#define TIMER_CTL2(timerx)               REG32((timerx) + 0x74U)                /*!< TIMER control register 2 */
#define TIMER_AFCTL0(timerx)             REG32((timerx) + 0x8CU)                /*!< TIMER alternate function control register 0 */
#define TIMER_CCHP1(timerx)              REG32((timerx) + 0x9CU)                /*!< TIMER complementary channel protection register 1 */
#define TIMER_WDGPER(timerx)             REG32((timerx) + 0x94U)        
#define TIMER_CINITCTL(timerx)           REG32((timerx) + 0xA4U)                /*!< TIMER counter initial control register */
#define TIMER_CINITV(timerx)             REG32((timerx) + 0xA8U)                /*!< TIMER counter initial value register */
#define TIMER_CHBRKCTL(timerx)           REG32((timerx) + 0xACU)                /*!< TIMER channel break control register */
#define TIMER_CHBRKPER(timerx)           REG32((timerx) + 0xB0U)                /*!< TIMER channel break period register */
#define TIMER_CHBRKINTF(timerx)          REG32((timerx) + 0xB4U)                /*!< TIMER channel break interrupt flag register */
#define TIMER_DMACFG(timerx)             REG32((timerx) + 0xE0U)                /*!< TIMER DMA configuration register */
#define TIMER_DMATB(timerx)              REG32((timerx) + 0xE4U)                /*!< DMA transfer buffer register*/
#define TIMER_CFG(timerx)                REG32((timerx) + 0xFCU)                /*!< TIMER configuration register */
        
