wajmh/Code/Firmware/GD32F50x_Firmware_Library/Firmware/GD32F50x_standard_peripheral/Include/gd32f50x_timer.h
/* TIMER_CNT */
#define TIMER_CNT_CNT                    BITS(0,15)                             /*!< 16 bit timer counter */
                    
/* TIMER_PSC */                 
#define TIMER_PSC_PSC                    BITS(0,15)                             /*!< prescaler value of the counter clock */
                    
/* TIMER_CAR */                 
#define TIMER_CAR_CARL                   BITS(0,15)                             /*!< 16 bit counter auto reload value */
                    
/* TIMER_CREP0 */                   
#define TIMER_CREP0_CREP0                BITS(0,7)                              /*!< counter repetition value 0 */
                    
/* TIMER_CH0CV */                   
#define TIMER_CH0CV_CH0VAL               BITS(0,15)                             /*!< 16 bit capture/compare value of channel 0 */
                    
/* TIMER_CH1CV */                   
#define TIMER_CH1CV_CH1VAL               BITS(0,15)                             /*!< 16 bit capture/compare value of channel 1 */
                    
/* TIMER_CH2CV */                   
#define TIMER_CH2CV_CH2VAL               BITS(0,15)                             /*!< 16 bit capture/compare value of channel 2 */
                    
/* TIMER_CH3CV */                   
#define TIMER_CH3CV_CH3VAL               BITS(0,15)                             /*!< 16 bit capture/compare value of channel 3 */
                    
/* TIMER_CCHP */                    
#define TIMER_CCHP0_DTCFG                BITS(0,7)                              /*!< dead time configure */
#define TIMER_CCHP0_PROT                 BITS(8,9)                              /*!< complementary register protect control */
#define TIMER_CCHP0_IOS                  BIT(10)                                /*!< idle mode off-state configure */
#define TIMER_CCHP0_ROS                  BIT(11)                                /*!< run mode off-state configure */
#define TIMER_CCHP0_BRKEN                BIT(12)                                /*!< BREAK input signal enable */
#define TIMER_CCHP0_BRKP                 BIT(13)                                /*!< BREAK input signal polarity */
#define TIMER_CCHP0_OAEN                 BIT(14)                                /*!< output automatic enable */
#define TIMER_CCHP0_POEN                 BIT(15)                                /*!< primary output enable */
#define TIMER_CCHP0_BRKF                 BITS(16,19)                            /*!< BREAK input signal filter */
#define TIMER_CCHP0_CHBRKEN              BIT(30)                                /*!< channel BREAK input signal enable */
#define TIMER_CCHP0_CHBRKP               BIT(31)                                /*!< channel BREAK input signal polarity */

/* TIMER_MCHCTL0 */
/* output compare mode */
#define TIMER_MCHCTL0_MCH0MS             (BITS(0,1) | BIT(30))                  /*!< multi mode channel 0 I/O mode selection */
#define TIMER_MCHCTL0_MCH0COMFEN         BIT(2)                                 /*!< multi mode channel 0 output compare fast enable */
#define TIMER_MCHCTL0_MCH0COMSEN         BIT(3)                                 /*!< multi mode channel 0 output compare shadow enable */
#define TIMER_MCHCTL0_MCH0COMCTL         (BITS(4,6) | BIT(16))                  /*!< multi mode channel 0 compare output control */
/* input capture mode */
#define TIMER_MCHCTL0_MCH0CAPPSC         BITS(2,3)                              /*!< multi mode channel 0 input capture prescaler */
#define TIMER_MCHCTL0_MCH0CAPFLT         BITS(4,7)                              /*!< multi mode channel 0 input capture filter control */

/* TIMER_MCHCTL2 */
#define TIMER_MCHCTL2_MCH0FP             BITS(0,1)                              /*!< multi mode channel 0 capture or compare function polarity */

/* TIMER_MCH0CV */
#define TIMER_MCH0CV_MCH0VAL             BITS(0,15)                             /*!< 16 bit capture or compare value of multi mode channel 0 */

/* TIMER_CH0COMV_ADD */
#define TIMER_CH0COMV_ADD_CH0COMVAL      BITS(0,15)                             /*!< additional compare value of channel 0 */
                    
/* TIMER_CH1COMV_ADD */                 
#define TIMER_CH1COMV_ADD_CH1COMVAL      BITS(0,15)                             /*!< additional compare value of channel 1 */
                    
/* TIMER_CH2COMV_ADD */                 
#define TIMER_CH2COMV_ADD_CH2COMVAL      BITS(0,15)                             /*!< additional compare value of channel 2 */
                    
/* TIMER_CH3COMV_ADD */                 
#define TIMER_CH3COMV_ADD_CH3COMVAL      BITS(0,15)                             /*!< additional compare value of channel 3 */

/* TIMER_CTL2 */
#define TIMER_CTL2_DTIENCH0              BIT(0)                                 /*!< dead time inserted enable for channel 0 */
#define TIMER_CTL2_DTIENCH1              BIT(1)                                 /*!< dead time inserted enable for channel 1 */
#define TIMER_CTL2_DTIENCH2              BIT(2)                                 /*!< dead time inserted enable for channel 2 */
#define TIMER_CTL2_DTIENCH3              BIT(3)                                 /*!< dead time inserted enable for channel 3 */
#define TIMER_CTL2_BRKENCH0              BIT(4)                                 /*!< break control enable for channel 0  */
#define TIMER_CTL2_BRKENCH1              BIT(5)                                 /*!< break control enable for channel 1  */
#define TIMER_CTL2_BRKENCH2              BIT(6)                                 /*!< break control enable for channel 2  */
#define TIMER_CTL2_BRKENCH3              BIT(7)                                 /*!< break control enable for channel 3  */
#define TIMER_CTL2_CH0OMPSEL             BITS(8,9)                              /*!< channel 0 output march pulse select */
#define TIMER_CTL2_CH1OMPSEL             BITS(10,11)                            /*!< channel 1 output march pulse select */
#define TIMER_CTL2_CH2OMPSEL             BITS(12,13)                            /*!< channel 2 output march pulse select */
#define TIMER_CTL2_CH3OMPSEL             BITS(14,15)                            /*!< channel 3 output march pulse select */
#define TIMER_CTL2_DECJDEN               BIT(18)                                /*!< Quadrature decoder signal jump (the two signals jump at the same time) detection enable */
#define TIMER_CTL2_DECDISDEN             BIT(19)                                /*!< Quadrature decoder signal disconnection detection enable */
#define TIMER_CTL2_MCH0MSEL              BITS(20,21)                            /*!< Multi mode channel 0 mode select */                       
#define TIMER_CTL2_CH0CPWMEN             BIT(28)                                /*!< channel 0 composite PWM mode enable */
#define TIMER_CTL2_CH1CPWMEN             BIT(29)                                /*!< channel 1 composite PWM mode enable */
#define TIMER_CTL2_CH2CPWMEN             BIT(30)                                /*!< channel 2 composite PWM mode enable */
#define TIMER_CTL2_CH3CPWMEN             BIT(31)                                /*!< channel 3 composite PWM mode enable */

/* TIMER_AFCTL0 */
#define TIMER_AFCTL0_BRKIN0EN            BIT(0)                                 /*!< BREAK BRKIN0 alternate function input enable */
#define TIMER_AFCTL0_BRKCMP0EN           BIT(9)                                 /*!< BREAK CMP0 enable */
#define TIMER_AFCTL0_BRKIN0P             BIT(16)                                /*!< BREAK BRKIN0 alternate function input polarity */
#define TIMER_AFCTL0_BRKCMP0P            BIT(25)                                /*!< BREAK CMP0 input polarity */

