wajmh/Code/Firmware/GD32F50x_Firmware_Library/Firmware/GD32F50x_standard_peripheral/Include/gd32f50x_timer.h
/* TIMER_CCHP1 */
#define TIMER_CCHP1_DTFCFG               BITS(0,7)                              /*!< dead time falling edge configure */
#define TIMER_CCHP1_DTDIFEN              BIT(16)                                /*!< dead time configure different enable */

/* TIMER_CINITCTL */
#define TIMER_CINITCTL_CINITVEN          BIT(0)                                 /*!< counter initial value register enable */
#define TIMER_CINITCTL_CINITDIR          BIT(1)                                 /*!< counter initial count direction */
#define TIMER_CINITCTL_SWSYNCG           BIT(2)                                 /*!< soft synchronization event generation */

/* TIMER_CINITV */
#define TIMER_CINITV_CINITVAL            BITS(0,15)                             /*!< counter initial value */

/* TIMER_CHBRKCTL */
#define TIMER_CHBRKCTL_CH0BRKMIE         BIT(0)                                 /*!< channel 0 BREAK multi-period interrupt enable */
#define TIMER_CHBRKCTL_CH1BRKMIE         BIT(1)                                 /*!< channel 1 BREAK multi-period interrupt enable */
#define TIMER_CHBRKCTL_CH2BRKMIE         BIT(2)                                 /*!< channel 2 BREAK multi-period interrupt enable */
#define TIMER_CHBRKCTL_CH0BRKINP         BIT(4)                                 /*!< channel 0 BREAK input signal polarity */
#define TIMER_CHBRKCTL_CH1BRKINP         BIT(5)                                 /*!< channel 1 BREAK input signal polarity */
#define TIMER_CHBRKCTL_CH2BRKINP         BIT(6)                                 /*!< channel 2 BREAK input signal polarity */
#define TIMER_CHBRKCTL_CH0BRKIE          BIT(8)                                 /*!< channel 0 BREAK interrupt enable */
#define TIMER_CHBRKCTL_CH1BRKIE          BIT(9)                                 /*!< channel 1 BREAK interrupt enable */
#define TIMER_CHBRKCTL_CH2BRKIE          BIT(10)                                /*!< channel 2 BREAK interrupt enable */
#define TIMER_CHBRKCTL_CH0BRKINEN        BIT(12)                                /*!< channel 0 BREAK input signal enable */
#define TIMER_CHBRKCTL_CH1BRKINEN        BIT(13)                                /*!< channel 1 BREAK input signal enable */
#define TIMER_CHBRKCTL_CH2BRKINEN        BIT(14)                                /*!< channel 2 BREAK input signal enable */
#define TIMER_CHBRKCTL_CHPOEN0           BIT(20)                                /*!< channel primary output enable 0 */
#define TIMER_CHBRKCTL_CHPOEN1           BIT(21)                                /*!< channel primary output enable 1 */
#define TIMER_CHBRKCTL_CHPOEN2           BIT(22)                                /*!< channel primary output enable 2 */

/* TIMER_CHBRKPER */
#define TIMER_CHBRKPER_PERCNT            BITS(0,15)                             /*!< channel BREAK period count */

/* TIMER_CHBRKINTF */
#define TIMER_CHBRKINTF_CH0BRKMIF        BIT(0)                                 /*!< channel 0 BREAK multi-period interrupt flag */
#define TIMER_CHBRKINTF_CH1BRKMIF        BIT(1)                                 /*!< channel 1 BREAK multi-period interrupt flag */
#define TIMER_CHBRKINTF_CH2BRKMIF        BIT(2)                                 /*!< channel 2 BREAK multi-period interrupt flag */
#define TIMER_CHBRKINTF_CH0BRKIF         BIT(4)                                 /*!< channel 0 BREAK interrupt flag */
#define TIMER_CHBRKINTF_CH1BRKIF         BIT(5)                                 /*!< channel 1 BREAK interrupt flag */
#define TIMER_CHBRKINTF_CH2BRKIF         BIT(6)                                 /*!< channel 2 BREAK interrupt flag */

/* TIMER_DMACFG */
#define TIMER_DMACFG_DMATA               BITS(0,5)                              /*!< DMA transfer access start address */
#define TIMER_DMACFG_DMATC               BITS(8,13)                             /*!< DMA transfer count */
                    
/* TIMER_DMATB */                   
#define TIMER_DMATB_DMATB                BITS(0,31)                             /*!< DMA transfer buffer */
                    
/* TIMER_CFG */                 
#define TIMER_CFG_OUTSEL                 BIT(0)                                 /*!< the output value selection */
#define TIMER_CFG_CHVSEL                 BIT(1)                                 /*!< write CHxVAL register selection */
#define TIMER_CFG_CCUSEL                 BIT(3)                                 /*!< Commutation control shadow register update select */
#define TIMER_CFG_OCPRECIVM              BIT(4)                                 /*!< output prepare signal clear invalid mode select */

/* constants definitions */
/* TIMER init parameter struct definitions*/
typedef struct { 
    uint16_t prescaler;                                                         /*!< prescaler value */
    uint16_t alignedmode;                                                       /*!< aligned mode */
    uint16_t counterdirection;                                                  /*!< counter direction */
    uint16_t clockdivision;                                                     /*!< clock division value */
    uint32_t period;                                                            /*!< period value */
    uint8_t  repetitioncounter;                                                 /*!< the counter repetition value */
}timer_parameter_struct;

/* break parameter struct definitions*/
typedef struct { 
    uint32_t runoffstate;                                                       /*!< run mode off-state */
    uint32_t ideloffstate;                                                      /*!< idle mode off-state */
    uint32_t deadtime;                                                          /*!< dead time */
    uint32_t outputautostate;                                                   /*!< output automatic enable */
    uint32_t protectmode;                                                       /*!< complementary register protect control */
    uint32_t breakstate;                                                        /*!< BREAK input enable */
    uint32_t breakfilter;                                                       /*!< BREAK input filter */
    uint32_t breakpolarity;                                                     /*!< BREAK input polarity */
}timer_break_parameter_struct;

/* channel output parameter struct definitions */
typedef struct { 
    uint16_t outputstate;                                                       /*!< channel output state */
    uint16_t outputnstate;                                                      /*!< channel complementary output state */
    uint16_t ocpolarity;                                                        /*!< channel output polarity */
    uint16_t ocnpolarity;                                                       /*!< channel complementary output polarity */
    uint16_t ocidlestate;                                                       /*!< idle state of channel output */
    uint16_t ocnidlestate;                                                      /*!< idle state of channel complementary output */
}timer_oc_parameter_struct;

/* multi mode channel output parameter struct definitions */
typedef struct {
    uint16_t outputmode;                                                        /*!< multi mode channel output mode selection */
    uint16_t outputstate;                                                       /*!< multi mode channel output state */
    uint16_t ocpolarity;                                                        /*!< multi mode channel output polarity */
} timer_omc_parameter_struct;

/* channel input parameter struct definitions */
typedef struct { 
    uint16_t icpolarity;                                                        /*!< channel input polarity */
    uint16_t icselection;                                                       /*!< channel input mode selection */
    uint16_t icprescaler;                                                       /*!< channel input capture prescaler */
    uint16_t icfilter;                                                          /*!< channel input capture filter control */
}timer_ic_parameter_struct;


