wajmh/Code/Firmware/GD32F50x_Firmware_Library/Firmware/GD32F50x_standard_peripheral/Include/gd32f50x_timer.h
/* define the TIMER bit position and its register index offset */
#define TIMER_REGIDX_BIT1(regidx, bitpos) (((uint32_t)(regidx) << 6U) | (uint32_t)(bitpos))
#define TIMER_REG_VAL1(timerx, offset)    (REG32((uint32_t)(timerx) + ((uint32_t)((offset) & 0x0000FFFFU) >> 6U)))
#define TIMER_BIT_POS1(val)               ((uint32_t)(val) & 0x0000001FU)
#define TIMER_REGIDX_BIT2(regidx, bitpos, regidx2, bitpos2)   (((uint32_t)(regidx2) << 22U) | (uint32_t)((bitpos2) << 16U)\
                                                              | (((uint32_t)(regidx) << 6U) | (uint32_t)(bitpos)))
#define TIMER_REG_VAL2(timerx, offset)       (REG32((timerx) + ((uint32_t)(offset) >> 22U)))
#define TIMER_BIT_POS2(val)                  (((uint32_t)(val) & 0x001F0000U) >> 16U)

/* register offset */
#define TIMER_DMAINTEN_REG_OFFSET                   ((uint32_t)0x0000000CU)                                                             /*!< DMAINTEN register offset */
#define TIMER_CHBRKCTL_REG_OFFSET                   ((uint32_t)0x000000ACU)                                                             /*!< CHBRKCTL register offset */
#define TIMER_INTF_REG_OFFSET                       ((uint32_t)0x00000010U)                                                             /*!< INTF register offset */
#define TIMER_CHBRKINTF_REG_OFFSET                  ((uint32_t)0x000000B4U)                                                             /*!< CHBRKINTF register offset */

/* TIMER interrupt enable or disable */
/* interrupt in DMAINTEN register */
#define TIMER_INT_UP                                 TIMER_REGIDX_BIT1(TIMER_DMAINTEN_REG_OFFSET, 0U)                                   /*!< update interrupt */
#define TIMER_INT_CH0                                TIMER_REGIDX_BIT1(TIMER_DMAINTEN_REG_OFFSET, 1U)                                   /*!< channel 0 capture or compare interrupt */
#define TIMER_INT_CH1                                TIMER_REGIDX_BIT1(TIMER_DMAINTEN_REG_OFFSET, 2U)                                   /*!< channel 1 capture or compare interrupt */
#define TIMER_INT_CH2                                TIMER_REGIDX_BIT1(TIMER_DMAINTEN_REG_OFFSET, 3U)                                   /*!< channel 2 capture or compare interrupt */
#define TIMER_INT_CH3                                TIMER_REGIDX_BIT1(TIMER_DMAINTEN_REG_OFFSET, 4U)                                   /*!< channel 3 capture or compare interrupt */
#define TIMER_INT_CMT                                TIMER_REGIDX_BIT1(TIMER_DMAINTEN_REG_OFFSET, 5U)                                   /*!< channel commutation interrupt flag */
#define TIMER_INT_TRG                                TIMER_REGIDX_BIT1(TIMER_DMAINTEN_REG_OFFSET, 6U)                                   /*!< trigger interrupt */
#define TIMER_INT_BRK                                TIMER_REGIDX_BIT1(TIMER_DMAINTEN_REG_OFFSET, 7U)                                   /*!< break interrupt */
#define TIMER_INT_DECJ                               TIMER_REGIDX_BIT1(TIMER_DMAINTEN_REG_OFFSET, 16U)                                  /*!< Quadrature decoder signal jump (the two signals jump at the same time) interrupt flag */
#define TIMER_INT_DECDIS                             TIMER_REGIDX_BIT1(TIMER_DMAINTEN_REG_OFFSET, 17U)                                  /*!< Quadrature decoder signal disconnection interrupt flag*/
#define TIMER_INT_MCH0                               TIMER_REGIDX_BIT1(TIMER_DMAINTEN_REG_OFFSET, 20U)                                  /*!< break interrupt */
#define TIMER_INT_CH0COMADD                          TIMER_REGIDX_BIT1(TIMER_DMAINTEN_REG_OFFSET, 28U)                                  /*!< channel 0 additional compare interrupt */
#define TIMER_INT_CH1COMADD                          TIMER_REGIDX_BIT1(TIMER_DMAINTEN_REG_OFFSET, 29U)                                  /*!< channel 1 additional compare interrupt */
#define TIMER_INT_CH2COMADD                          TIMER_REGIDX_BIT1(TIMER_DMAINTEN_REG_OFFSET, 30U)                                  /*!< channel 2 additional compare interrupt */
#define TIMER_INT_CH3COMADD                          TIMER_REGIDX_BIT1(TIMER_DMAINTEN_REG_OFFSET, 31U)                                  /*!< channel 3 additional compare interrupt */
/* interrupt in CHBRKCTL register */                                    
#define TIMER_INT_CH0BRKM                            TIMER_REGIDX_BIT1(TIMER_CHBRKCTL_REG_OFFSET, 0U)                                   /*!< channel 0 BREAK multi-period interrupt */
#define TIMER_INT_CH1BRKM                            TIMER_REGIDX_BIT1(TIMER_CHBRKCTL_REG_OFFSET, 1U)                                   /*!< channel 1 BREAK multi-period interrupt */
#define TIMER_INT_CH2BRKM                            TIMER_REGIDX_BIT1(TIMER_CHBRKCTL_REG_OFFSET, 2U)                                   /*!< channel 2 BREAK multi-period interrupt */
#define TIMER_INT_CH0BRK                             TIMER_REGIDX_BIT1(TIMER_CHBRKCTL_REG_OFFSET, 8U)                                   /*!< channel 0 BREAK interrupt */
#define TIMER_INT_CH1BRK                             TIMER_REGIDX_BIT1(TIMER_CHBRKCTL_REG_OFFSET, 9U)                                   /*!< channel 1 BREAK interrupt */
#define TIMER_INT_CH2BRK                             TIMER_REGIDX_BIT1(TIMER_CHBRKCTL_REG_OFFSET, 10U)                                  /*!< channel 2 BREAK interrupt */
            
/* TIMER interrupt flag */
/* interrupt flag in INTF register */
#define TIMER_INT_FLAG_UP                            TIMER_REGIDX_BIT2(TIMER_DMAINTEN_REG_OFFSET, 0U, TIMER_INTF_REG_OFFSET, 0U)        /*!< update interrupt flag */
#define TIMER_INT_FLAG_CH0                           TIMER_REGIDX_BIT2(TIMER_DMAINTEN_REG_OFFSET, 1U, TIMER_INTF_REG_OFFSET, 1U)        /*!< channel 0 capture or compare interrupt flag */
#define TIMER_INT_FLAG_CH1                           TIMER_REGIDX_BIT2(TIMER_DMAINTEN_REG_OFFSET, 2U, TIMER_INTF_REG_OFFSET, 2U)        /*!< channel 1 capture or compare interrupt flag */
#define TIMER_INT_FLAG_CH2                           TIMER_REGIDX_BIT2(TIMER_DMAINTEN_REG_OFFSET, 3U, TIMER_INTF_REG_OFFSET, 3U)        /*!< channel 2 capture or compare interrupt flag */
#define TIMER_INT_FLAG_CH3                           TIMER_REGIDX_BIT2(TIMER_DMAINTEN_REG_OFFSET, 4U, TIMER_INTF_REG_OFFSET, 4U)        /*!< channel 3 capture or compare interrupt flag */
#define TIMER_INT_FLAG_CMT                           TIMER_REGIDX_BIT2(TIMER_DMAINTEN_REG_OFFSET, 5U, TIMER_INTF_REG_OFFSET, 5U)        /*!< channel commutation interrupt flag */
#define TIMER_INT_FLAG_TRG                           TIMER_REGIDX_BIT2(TIMER_DMAINTEN_REG_OFFSET, 6U, TIMER_INTF_REG_OFFSET, 6U)        /*!< trigger interrupt flag */
#define TIMER_INT_FLAG_BRK                           TIMER_REGIDX_BIT2(TIMER_DMAINTEN_REG_OFFSET, 7U, TIMER_INTF_REG_OFFSET, 7U)        /*!< BREAK interrupt flag */
#define TIMER_INT_FLAG_SYSB                          TIMER_REGIDX_BIT2(TIMER_DMAINTEN_REG_OFFSET, 7U, TIMER_INTF_REG_OFFSET, 13U)       /*!< system source break interrupt flag */
#define TIMER_INT_FLAG_DECJ                          TIMER_REGIDX_BIT2(TIMER_DMAINTEN_REG_OFFSET, 16U, TIMER_INTF_REG_OFFSET, 16U)      /*!< quadrature decoder signal jump (the two signals jump at the same time) interrupt flag */
#define TIMER_INT_FLAG_DECDIS                        TIMER_REGIDX_BIT2(TIMER_DMAINTEN_REG_OFFSET, 17U, TIMER_INTF_REG_OFFSET, 17U)      /*!< quadrature decoder signal disconnection interrupt flag */
#define TIMER_INT_FLAG_MCH0                          TIMER_REGIDX_BIT2(TIMER_DMAINTEN_REG_OFFSET, 20U, TIMER_INTF_REG_OFFSET, 20U)      /*!< multi mode channel 0 capture or compare interrupt flag */
#define TIMER_INT_FLAG_CH0COMADD                     TIMER_REGIDX_BIT2(TIMER_DMAINTEN_REG_OFFSET, 28U, TIMER_INTF_REG_OFFSET, 28U)      /*!< channel 0 additional compare interrupt flag */
#define TIMER_INT_FLAG_CH1COMADD                     TIMER_REGIDX_BIT2(TIMER_DMAINTEN_REG_OFFSET, 29U, TIMER_INTF_REG_OFFSET, 29U)      /*!< channel 1 additional compare interrupt flag */
#define TIMER_INT_FLAG_CH2COMADD                     TIMER_REGIDX_BIT2(TIMER_DMAINTEN_REG_OFFSET, 30U, TIMER_INTF_REG_OFFSET, 30U)      /*!< channel 2 additional compare interrupt flag */
#define TIMER_INT_FLAG_CH3COMADD                     TIMER_REGIDX_BIT2(TIMER_DMAINTEN_REG_OFFSET, 31U, TIMER_INTF_REG_OFFSET, 31U)      /*!< channel 3 additional compare interrupt flag */
/* interrupt flag in CHBRKINTF register */           
#define TIMER_INT_FLAG_CH0BRKM                       TIMER_REGIDX_BIT2(TIMER_CHBRKCTL_REG_OFFSET, 0U, TIMER_CHBRKINTF_REG_OFFSET, 0U)   /*!< channel 0 BREAK multi-period interrupt flag */
#define TIMER_INT_FLAG_CH1BRKM                       TIMER_REGIDX_BIT2(TIMER_CHBRKCTL_REG_OFFSET, 1U, TIMER_CHBRKINTF_REG_OFFSET, 1U)   /*!< channel 1 BREAK multi-period interrupt flag */
#define TIMER_INT_FLAG_CH2BRKM                       TIMER_REGIDX_BIT2(TIMER_CHBRKCTL_REG_OFFSET, 2U, TIMER_CHBRKINTF_REG_OFFSET, 2U)   /*!< channel 2 BREAK multi-period interrupt flag */
#define TIMER_INT_FLAG_CH0BRK                        TIMER_REGIDX_BIT2(TIMER_CHBRKCTL_REG_OFFSET, 8U, TIMER_CHBRKINTF_REG_OFFSET, 4U)   /*!< channel 0 BREAK interrupt flag */
#define TIMER_INT_FLAG_CH1BRK                        TIMER_REGIDX_BIT2(TIMER_CHBRKCTL_REG_OFFSET, 9U, TIMER_CHBRKINTF_REG_OFFSET, 5U)   /*!< channel 1 BREAK interrupt flag */
#define TIMER_INT_FLAG_CH2BRK                        TIMER_REGIDX_BIT2(TIMER_CHBRKCTL_REG_OFFSET, 10U, TIMER_CHBRKINTF_REG_OFFSET, 6U)  /*!< channel 2 BREAK interrupt flag */

/* TIMER flag */
/* flag in INTF register */
#define TIMER_FLAG_UP                                TIMER_REGIDX_BIT1(TIMER_INTF_REG_OFFSET, 0U)                                       /*!< update interrupt flag */
#define TIMER_FLAG_CH0                               TIMER_REGIDX_BIT1(TIMER_INTF_REG_OFFSET, 1U)                                       /*!< channel 0 capture or compare interrupt flag */
#define TIMER_FLAG_CH1                               TIMER_REGIDX_BIT1(TIMER_INTF_REG_OFFSET, 2U)                                       /*!< channel 1 capture or compare interrupt flag */
#define TIMER_FLAG_CH2                               TIMER_REGIDX_BIT1(TIMER_INTF_REG_OFFSET, 3U)                                       /*!< channel 2 capture or compare interrupt flag */
#define TIMER_FLAG_CH3                               TIMER_REGIDX_BIT1(TIMER_INTF_REG_OFFSET, 4U)                                       /*!< channel 3 capture or compare interrupt flag */
#define TIMER_FLAG_CMT                               TIMER_REGIDX_BIT1(TIMER_INTF_REG_OFFSET, 5U)                                       /*!< channel commutation interrupt flag */
#define TIMER_FLAG_TRG                               TIMER_REGIDX_BIT1(TIMER_INTF_REG_OFFSET, 6U)                                       /*!< trigger interrupt flag */
#define TIMER_FLAG_BRK                               TIMER_REGIDX_BIT1(TIMER_INTF_REG_OFFSET, 7U)                                       /*!< BREAK interrupt flag */
#define TIMER_FLAG_CH0O                              TIMER_REGIDX_BIT1(TIMER_INTF_REG_OFFSET, 9U)                                       /*!< channel 0 over capture flag */
#define TIMER_FLAG_CH1O                              TIMER_REGIDX_BIT1(TIMER_INTF_REG_OFFSET, 10U)                                      /*!< channel 1 over capture flag */
#define TIMER_FLAG_CH2O                              TIMER_REGIDX_BIT1(TIMER_INTF_REG_OFFSET, 11U)                                      /*!< channel 2 over capture flag */
#define TIMER_FLAG_CH3O                              TIMER_REGIDX_BIT1(TIMER_INTF_REG_OFFSET, 12U)                                      /*!< channel 3 over capture flag */
#define TIMER_FLAG_SYSB                              TIMER_REGIDX_BIT1(TIMER_INTF_REG_OFFSET, 13U)                                      /*!< system source break interrupt flag */
#define TIMER_FLAG_DECJ                              TIMER_REGIDX_BIT1(TIMER_INTF_REG_OFFSET, 16U)                                      /*!< quadrature decoder signal jump (the two signals jump at the same time) interrupt flag */
#define TIMER_FLAG_DECDIS                            TIMER_REGIDX_BIT1(TIMER_INTF_REG_OFFSET, 17U)                                      /*!< quadrature decoder signal disconnection interrupt flag */
#define TIMER_FLAG_MCH0                              TIMER_REGIDX_BIT1(TIMER_INTF_REG_OFFSET, 20U)                                      /*!< multi mode channel 0 capture/compare interrupt flag */
#define TIMER_FLAG_MCH0O                             TIMER_REGIDX_BIT1(TIMER_INTF_REG_OFFSET, 24U)                                      /*!< multi mode channel 0 over capture flag */
#define TIMER_FLAG_CH0COMADD                         TIMER_REGIDX_BIT1(TIMER_INTF_REG_OFFSET, 28U)                                      /*!< channel 0 additional compare interrupt flag */
#define TIMER_FLAG_CH1COMADD                         TIMER_REGIDX_BIT1(TIMER_INTF_REG_OFFSET, 29U)                                      /*!< channel 1 additional compare interrupt flag */
#define TIMER_FLAG_CH2COMADD                         TIMER_REGIDX_BIT1(TIMER_INTF_REG_OFFSET, 30U)                                      /*!< channel 2 additional compare interrupt flag */
#define TIMER_FLAG_CH3COMADD                         TIMER_REGIDX_BIT1(TIMER_INTF_REG_OFFSET, 31U)                                      /*!< channel 3 additional compare interrupt flag */
/* flag in CHBRKINTF register */     
#define TIMER_FLAG_CH0BRKM                           TIMER_REGIDX_BIT1(TIMER_CHBRKINTF_REG_OFFSET, 0U)                                  /*!< channel 0 BREAK multi-period interrupt flag */
#define TIMER_FLAG_CH1BRKM                           TIMER_REGIDX_BIT1(TIMER_CHBRKINTF_REG_OFFSET, 1U)                                  /*!< channel 1 BREAK multi-period interrupt flag */
#define TIMER_FLAG_CH2BRKM                           TIMER_REGIDX_BIT1(TIMER_CHBRKINTF_REG_OFFSET, 2U)                                  /*!< channel 2 BREAK multi-period interrupt flag */
#define TIMER_FLAG_CH0BRK                            TIMER_REGIDX_BIT1(TIMER_CHBRKINTF_REG_OFFSET, 4U)                                  /*!< channel 0 BREAK interrupt flag */
#define TIMER_FLAG_CH1BRK                            TIMER_REGIDX_BIT1(TIMER_CHBRKINTF_REG_OFFSET, 5U)                                  /*!< channel 1 BREAK interrupt flag */
#define TIMER_FLAG_CH2BRK                            TIMER_REGIDX_BIT1(TIMER_CHBRKINTF_REG_OFFSET, 6U)                                  /*!< channel 2 BREAK interrupt flag */

